app/controllers/lunches_controller.rb

INSERT INTO "lunches" ("calories", "cost", "created_at", "food", "updated_at") VALUES (?, ?, ?, ?, ?)  [["calories", 3000.0], ["cost", 22.0], ["created_at", Wed, 10 Jul 2013 05:19:39 UTC +00:00], ["food", "deez nutz"], ["updated_at", Wed, 10 Jul 2013 05:19:39 UTC +00:00]]
---
  def create
    @lunch = Lunch.new(lunch_params)

    respond_to do |format|
      if @lunch.save

SELECT "lunches".* FROM "lunches" WHERE "lunches"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_lunch
      @lunch = Lunch.find(params[:id])